In [1]:
import pandas as pd

#### score.xlsx 파일 읽기

In [2]:
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

### DataFrame 확인

#### 기초 통계량 확인

In [3]:
df.describe()

              나이          점수
count   6.000000    6.000000
mean   25.333333   85.333333
std     5.163978   15.055453
min    20.000000   60.000000
25%    21.500000   79.000000
50%    24.000000   89.000000
75%    28.750000   96.000000
max    33.000000  100.000000

#### DataFrame 기본정보 확인

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 1번 to 6번
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   주소      6 non-null      object
 2   나이      6 non-null      int64
 3   점수      6 non-null      int64
 4   언어      4 non-null      object
dtypes: int64(2), object(3)
memory usage: 288.0+ bytes

#### df의 처음 5개 행 확인

In [5]:
df.head()

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN

#### df의 처음 3개 행 확인

In [6]:
df.head(3)

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
2번  이길동  서울  23  88    Java
3번  강길동  대구  30  98     C++

#### df의 마지막 5개 행 확인

In [7]:
df.tail()

     이름  주소  나이   점수    언어
번호
2번  이길동  서울  23   88  Java
3번  강길동  대구  30   98   C++
4번  홍길동  대전  20  100   NaN
5번  박길동  광주  21   60   NaN
6번  나길동  서울  25   90     C

#### df의 마지막 3개 행 확인

In [8]:
df.tail(3)

     이름  주소  나이   점수   언어
번호
4번  홍길동  대전  20  100  NaN
5번  박길동  광주  21   60  NaN
6번  나길동  서울  25   90    C

#### df의 데이터값 확인

In [9]:
df.values

array([['김길동', '광주', 33, 76, 'Python'],
       ['이길동', '서울', 23, 88, 'Java'],
       ['강길동', '대구', 30, 98, 'C++'],
       ['홍길동', '대전', 20, 100, nan],
       ['박길동', '광주', 21, 60, nan],
       ['나길동', '서울', 25, 90, 'C']], dtype=object)

#### 인덱스, 컬럼, 구조 확인

In [10]:
df.index

Index(['1번', '2번', '3번', '4번', '5번', '6번'], dtype='object', name='번호')

In [11]:
df.columns

Index(['이름', '주소', '나이', '점수', '언어'], dtype='object')

In [12]:
df.shape

(6, 5)

In [13]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

### Series 확인

#### Series의 통계량 확인

In [14]:
df['점수'].describe()

count      6.000000
mean      85.333333
std       15.055453
min       60.000000
25%       79.000000
50%       89.000000
75%       96.000000
max      100.000000
Name: 점수, dtype: float64

#### 점수 컬럼의 최대/최소 / 큰값 순으로 몇개 / 평균 / 합

In [15]:
df['점수'].min()

60

In [16]:
df['점수'].max()

100

In [17]:
df['점수'].nlargest(3)

번호
4번    100
3번     98
6번     90
Name: 점수, dtype: int64

In [18]:
df['점수'].mean()

np.float64(85.33333333333333)

In [19]:
df['점수'].sum()

np.int64(512)

In [20]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

#### 특정열의 개수 카운트 / 유일값 / 유일값 개수 (언어, 주소 컬럼)

In [21]:
df['언어'].count()

np.int64(4)

In [22]:
df['주소'].unique()

array(['광주', '서울', '대구', '대전'], dtype=object)

In [23]:
df['주소'].nunique()

4